Tekla Open API Reference for Tekla Structures 2025
Assembly.SetMainPart Method
 Sets the main part of the assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetMainPart(
	Part Part
)
Public Function SetMainPart (
	Part As Part
) As Boolean
Parameters
Part
Type: Tekla.Structures.Model.Part
The part to set as the main part of the assembly.
Return Value
Type: Boolean
True if the part was valid.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace